In [1]:
%load_ext sql

In [2]:
%run create_tables.py

In [3]:
%run etl.py

71 files found in data/song_data
1/71 files processed.
2/71 files processed.
3/71 files processed.
4/71 files processed.
5/71 files processed.
6/71 files processed.
7/71 files processed.
8/71 files processed.
9/71 files processed.
10/71 files processed.
11/71 files processed.
12/71 files processed.
13/71 files processed.
14/71 files processed.
15/71 files processed.
16/71 files processed.
17/71 files processed.
18/71 files processed.
19/71 files processed.
20/71 files processed.
21/71 files processed.
22/71 files processed.
23/71 files processed.
24/71 files processed.
25/71 files processed.
26/71 files processed.
27/71 files processed.
28/71 files processed.
29/71 files processed.
30/71 files processed.
31/71 files processed.
32/71 files processed.
33/71 files processed.
34/71 files processed.
35/71 files processed.
36/71 files processed.
37/71 files processed.
38/71 files processed.
39/71 files processed.
40/71 files processed.
41/71 files processed.
42/71 files processed.
43/71 files processed.
44/71 files processed.
45/71 files processed.
46/71 files processed.
47/71 files processed.
48/71 files processed.
49/71 files processed.
50/71 files processed.
51/71 files processed.
52/71 files processed.
53/71 files processed.
54/71 files processed.
55/71 files processed.
56/71 files processed.
57/71 files processed.
58/71 files processed.
59/71 files processed.
60/71 files processed.
61/71 files processed.
62/71 files processed.
63/71 files processed.
64/71 files processed.
65/71 files processed.
66/71 files processed.
67/71 files processed.
68/71 files processed.
69/71 files processed.
70/71 files processed.
71/71 files processed.
30 files found in data/log_data
1/30 files processed.
2/30 files processed.
3/30 files processed.
4/30 files processed.
5/30 files processed.
6/30 files processed.
7/30 files processed.
8/30 files processed.
9/30 files processed.
10/30 files processed.
11/30 files processed.
12/30 files processed.
13/30 files processed.
14/30 files processed.
15/30 files processed.
16/30 files processed.
17/30 files processed.
18/30 files processed.
19/30 files processed.
20/30 files processed.
21/30 files processed.
22/30 files processed.
23/30 files processed.
24/30 files processed.
25/30 files processed.
26/30 files processed.
27/30 files processed.
28/30 files processed.
29/30 files processed.
30/30 files processed.

In [4]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [5]:
%sql SELECT count(*) FROM songplays;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [6]:
%sql SELECT count(*) FROM time;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [7]:
%sql SELECT count(*) FROM songs;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(71,)]

In [8]:
%sql SELECT count(*) FROM users;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(96,)]

In [9]:
%sql SELECT count(*) FROM artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [10]:
%sql SELECT * FROM users limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[(79, 'James', 'Martin', 'M', 'free'),
 (78, 'Chloe', 'Roth', 'F', 'free'),
 (101, 'Jayden', 'Fox', 'M', 'free'),
 (14, 'Theodore', 'Harris', 'M', 'free'),
 (52, 'Theodore', 'Smith', 'M', 'free'),
 (35, 'Molly', 'Taylor', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (50, 'Ava', 'Robinson', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'paid')]

In [11]:
%sql SELECT * FROM songs limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('SOFNOQK12AB01840FC', 'Kutt Free (DJ Volume Remix)', 'ARNNKDK1187B98BBD5', 0, 407.37914),
 ('SOBAYLL12A8C138AF9', 'Sono andati? Fingevo di dormire', 'ARDR4AC1187FB371A1', 0, 511.16363),
 ('SOFFKZS12AB017F194', 'A Higher Place (Album Version)', 'ARBEBBY1187B9B43DB', 1994, 236.17261),
 ('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, 337.68444),
 ('SOXILUQ12A58A7C72A', 'Jenny Take a Ride', 'ARP6N5A1187B99D1A3', 2004, 207.43791),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', 0, 338.23302),
 ('SOBKWDJ12A8C13B2F3', 'Wild Rose (Back 2 Basics Mix)', 'AR36F9J1187FB406F1', 0, 230.71302),
 ('SOOJPRH12A8C141995', 'Loaded Like A Gun', 'ARBGXIG122988F409D', 0, 173.19138),
 ('SOPEGZN12AB0181B3D', 'Get Your Head Stuck On Your Neck', 'AREDL271187FB40F44', 0, 45.66159),
 ('SOQOTLQ12AB01868D0', 'Clementina Santafè', 'ARGCY1Y1187B9A4FA5', 0, 153.33832)]

In [12]:
%sql SELECT * FROM artists limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('ARNNKDK1187B98BBD5', 'Jinx', 'Zagreb Croatia', '45.80726', '15.967600000000001'),
 ('ARDR4AC1187FB371A1', 'Montserrat Caballé;Placido Domingo;Vicente Sardinero;Judith Blegen;Sherrill Milnes;Georg Solti', '', 'NaN', 'NaN'),
 ('ARBEBBY1187B9B43DB', 'Tom Petty', 'Gainesville, FL', 'NaN', 'NaN'),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', 'NaN', 'NaN'),
 ('ARP6N5A1187B99D1A3', 'Mitch Ryder', 'Hamtramck, MI', 'NaN', 'NaN'),
 ('ARAGB2O1187FB3A161', 'Pucho & His Latin Soul Brothers', '', 'NaN', 'NaN'),
 ('AR36F9J1187FB406F1', 'Bombay Rockers', 'Denmark', '56.27609', '9.51695'),
 ('ARBGXIG122988F409D', 'Steel Rain', 'California - SF', '37.77916', '-122.42005'),
 ('AREDL271187FB40F44', 'Soul Mekanik', '', 'NaN', 'NaN'),
 ('ARGCY1Y1187B9A4FA5', 'Gloriana', 'Nashville, TN.', '36.16778', '-86.77836')]

In [13]:
%sql SELECT * FROM time limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[(datetime.time(0, 0, 57, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 1, 30, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 4, 1, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 4, 55, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 7, 13, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 10, 56, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 11, 4, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 14, 10, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 16, 2, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.time(0, 18, 11, 796000), 0, 29, 48, 11, 2018, 3)]

In [14]:
%sql select s.song_id, a.artist_id, *  from songs s left join artists a on s.artist_id = a.artist_id where s.duration = 236.17261 and a.name = 'Tom Petty' and s.title = 'A Higher Place (Album Version)';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOFFKZS12AB017F194', 'ARBEBBY1187B9B43DB', 'SOFFKZS12AB017F194', 'A Higher Place (Album Version)', 'ARBEBBY1187B9B43DB', 1994, 236.17261, 'ARBEBBY1187B9B43DB', 'Tom Petty', 'Gainesville, FL', 'NaN', 'NaN')]

In [15]:
%sql SELECT * FROM songplays limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[(0, datetime.time(0, 0, 57, 796000), 73, 'paid', None, None, '954', 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (1, datetime.time(0, 1, 30, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.time(0, 4, 1, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.time(0, 4, 55, 796000), 73, 'paid', None, None, '954', 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (4, datetime.time(0, 7, 13, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (5, datetime.time(0, 10, 56, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (6, datetime.time(0, 11, 4, 796000), 73, 'paid', None, None, '954', 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (7, datetime.time(0, 14, 10, 796000), 73, 'paid', None, None, '954', 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (8, datetime.time(0, 16, 2, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (9, datetime.time(0, 18, 11, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [16]:
%sql SELECT count(*) FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [17]:
%sql SELECT count(*) FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [18]:
%sql SELECT user_id, count(distinct songplay_id) FROM songplays group by user_id order by count(distinct songplay_id) desc LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(49, 390), (97, 350), (80, 338), (15, 297), (44, 286)]

In [21]:
%sql select * from songplays limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(0, datetime.time(0, 0, 57, 796000), 73, 'paid', None, None, '954', 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (1, datetime.time(0, 1, 30, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.time(0, 4, 1, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.time(0, 4, 55, 796000), 73, 'paid', None, None, '954', 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (4, datetime.time(0, 7, 13, 796000), 24, 'paid', None, None, '984', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).